app/Http/Controllers/AppealController.php

select * from `appeals` where `status` = 'CONFIRM' order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `appeals` where `status` = 'CONFIRM'
select * from `appeals` where `is_fixed` = 1
---
    public function index():View
    {
        $appeals = Appeal::query()
            ->where('status', AppealEnum::CONFIRM->name)
            ->orderByDesc('updated_at')->paginate(5);

        $apeals_fixed = Appeal::query()->where('is_fixed', 1)->get();